УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Договоры/КонтурЛогистика_Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Договоры</name>
  <attributes>
    <name>Организация</name>
    <comment>Организация к которой относится договор Можно заполнить как организацию так и Организацию ИНН</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияИНН</name>
    <comment>Можно заполнить как организацию так и Организацию ИНН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>с какой организацией заключен договор</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИНН</name>
    <comment>Можно заполнить как Контрагента так и Контрагент ИНН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <comment>Номер договора</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <comment>Дата договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведения</name>
    <comment>необязательно, Дополнительные сведения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдДок</name>
    <comment>Идентификатор файла документа (в том числе регистрационный номер, если документ / сведения о таком документе содержатся в государственных информационных системах)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <comment>Заполняется или УчастникИНН ил  Участник</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникИНН</name>
      <comment>Заполняется или УчастникИНН ил  Участник</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Договоры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеКлючейПоиска() Экспорт
	
	// Поиск договора осуществляется по:
	// 1. Организация + Контрагент + Номер договора + Дата договора
	// 2. Организация + Номер договора + Дата договора
	// 3. Организация + Идентификатор файла документа
	
	ШаблонСтрокиПоиска = " И КонтурЛогистика_Справочник.%1 = &%1";
	
	КлючиПоиска = Новый Массив;
	
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"Организация,Контрагент,НомерДокумента,ДатаДокумента", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"Организация,НомерДокумента,ДатаДокумента", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"Организация,ИдДок", ШаблонСтрокиПоиска);
	
	Возврат КлючиПоиска;
	
КонецФункции

Функция ТекстОшибкиНеЗаполненыКлючевыеРеквизиты() Экспорт
	
	ТекстОшибки = "Ошибка при поиске Договора. Не заполнен один из ключевых реквизитов:
		|1. Организация + Контрагент + Номер договора + Дата договора
		|2. Организация + Номер договора + Дата договора
		|3. Организация + Идентификатор файла документа";
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Найти(Данные.Наименование, Данные.НомерДокумента) > 0 Тогда
		Представление = СокрЛП(Данные.Наименование);
	Иначе
		Представление = СокрЛП(Данные.Наименование) + " №" + Данные.НомерДокумента + " от " + Формат(Данные.ДатаДокумента, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Определяем состав необходмых полей
	Поля.Добавить("НомерДокумента");
	Поля.Добавить("ДатаДокумента");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Функция НайтиДоговорПоНомерДатаКонтрагентИНН(НомерДокумента, ДатаДокумента, КонтрагентИНН = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("КонтрагентИНН", КонтрагентИНН);
	Запрос.УстановитьПараметр("ЗаполненКонтрагентИНН", ЗначениеЗаполнено(КонтрагентИНН));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_Договоры КАК КонтурЛогистика_Договоры
	|ГДЕ
	|	НЕ КонтурЛогистика_Договоры.ПометкаУдаления
	|	И КонтурЛогистика_Договоры.НомерДокумента = &НомерДокумента
	|	И КонтурЛогистика_Договоры.ДатаДокумента = &ДатаДокумента
	|	И ВЫБОР
	|			КОГДА &ЗаполненКонтрагентИНН
	|				ТОГДА КонтурЛогистика_Договоры.КонтрагентИНН = &КонтрагентИНН
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
